In [3]:
import numpy as np
import random
import pandas as pd
from pandas import DataFrame, Series
import datetime
import time
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
#-*- coding: utf-8 -*-
df = pd.read_csv('df.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 10 columns):
Unnamed: 0            1000000 non-null int64
CLNN                  1000000 non-null int64
TS_D                  1000000 non-null object
FINAL_CD              1000000 non-null int64
SAA                   1000000 non-null int64
MCT_ADM_GDS_APB_CD    1000000 non-null int64
DOF_TF                1000000 non-null int64
DAW_CCD               1000000 non-null int64
MCT_N                 1000000 non-null int64
TIME                  1000000 non-null int64
dtypes: int64(9), object(1)
memory usage: 76.3+ MB

In [5]:
df['HOUR'] = df['TIME']/10000
df['HOUR'] = df.HOUR.astype(int)

In [10]:
gb02 = df.groupby(['CLNN', 'MCT_ADM_GDS_APB_CD', 'HOUR'])
gb02.count().head()

                              Unnamed: 0  TS_D  FINAL_CD  SAA  DOF_TF  \
CLNN MCT_ADM_GDS_APB_CD HOUR
0    2                  21             1     1         1    1       1
     3                  14             1     1         1    1       1
     4                  1              1     1         1    1       1
                        5              1     1         1    1       1
                        19             1     1         1    1       1

                              DAW_CCD  MCT_N  TIME
CLNN MCT_ADM_GDS_APB_CD HOUR
0    2                  21          1      1     1
     3                  14          1      1     1
     4                  1           1      1     1
                        5           1      1     1
                        19          1      1     1

In [17]:
gb02.sum().head()

                              Unnamed: 0  FINAL_CD  SAA  DOF_TF  DAW_CCD  \
CLNN MCT_ADM_GDS_APB_CD HOUR
0    2                  21        196591        43    5       1        1
     3                  14        341648        34   42       0        1
     4                  1         963763        47    7       0        1
                        5         621887        73   12       0        5
                        19        386666        34    6       0        4

                              MCT_N    TIME
CLNN MCT_ADM_GDS_APB_CD HOUR
0    2                  21       11  219788
     3                  14       96  141713
     4                  1        66   11551
                        5        19   58536
                        19       94  190433

In [42]:
gb02.sum().tail()

,,,Unnamed: 0,FINAL_CD,SAA,DOF_TF,DAW_CCD,MCT_N,TIME
CLNN,MCT_ADM_GDS_APB_CD,HOUR,,,,,,,
47645,7,12,604422,49,13,0,0,57,123713
47954,16,1,713447,30,14,1,4,23,10613
48262,36,23,57629,77,16,0,1,80,238625
48506,18,9,974143,90,6,0,1,83,93301
52504,1,11,630615,22,9,1,3,41,115435

In [ ]:
df.groupby(['CLNN', 'MCT_ADM_GDS_APB_CD', 'HOUR'], \
           as_index=False).nth(1).sort_values(['SAA'], ascending=False)
# 
# ['CLNN', 'MCT_ADM_GDS_APB_CD', 'HOUR', 'SAA']

In [ ]:
# Data Match

In [33]:
col01a = np.random.randn(len(np.unique(df.MCT_ADM_GDS_APB_CD)), 1) # MCT_ADM_GDS_APB_CD # 서울 행정동 코드 # HJ_CD
col01 = np.round(np.sqrt(np.square(col01a)) * 30)

139

In [41]:
col02 = [random.choice(['명동', '쌍문동', '상암동', '구로동', '여의동', \
                        '강일동', '역삼동', '잠실1동', '목동', '이태원동', \
                        '한남동', '행당동', '자양1동', '상계1동', '웅암동', \
                        '신림동', '사당동', '서초동', '방배동', '잠실2동', \
                        '반포동', '신길1동', '상도동', '시흥동', '화곡1동', \
                        '신정동', '신월동', '북가좌동', '상계2동', '정릉동',\
                        '면목1동', '성수동', '중곡동', '자양2동', '면목2동',\
                        '면목3동', '창동', '상계3동', '연희동', '대치동',\
                        '개포동', '성내동', '창신동', '중계동', '합정동', \
                        '연남동', '방화동', '신길2동', '대림동', '낙성대동',\
                        '신사동', '삼성동', '문정동', '암사동', '삼청동', \
                        '부암동', '회현동', '소공동', '황학동', '후암동', \
                        '화곡2동', '화곡3동', '영등포동', '을지로동', '신당동'
                       ]) for _ in range(139)] # HJ_CD_NM

In [43]:
place = pd.DataFrame( np.column_stack([col01, col02])
                  , columns = ['HJ_CD', 'HJ_CD_NM'])

In [48]:
place.to_csv('place.csv')

In [46]:
col03 = range(0, 100) # FINAL_CD 
col04 = [random.choice(['여행', '의료', '생활편의', '문화', '카페/베이커리', '주유']) for _ in range(100)] # FINAL_CD_NM

In [47]:
mct = pd.DataFrame( np.column_stack([col03, col04]), columns = ['FINAL_CD', 'FINAL_CD_NM'])

In [49]:
mct.to_csv('mct.csv')

In [50]:
# Matching

In [52]:
# First, remove first two rows from gb02
gb02_df = pd.DataFrame(gb02)
gb02_df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 978665 entries, (0, 2, 21) to (52504, 1, 11)
Data columns (total 8 columns):
Unnamed: 0    978665 non-null int64
TS_D          978665 non-null int64
FINAL_CD      978665 non-null int64
SAA           978665 non-null int64
DOF_TF        978665 non-null int64
DAW_CCD       978665 non-null int64
MCT_N         978665 non-null int64
TIME          978665 non-null int64
dtypes: int64(8)
memory usage: 64.6 MB

In [65]:
gb02_df = gb02_df.drop(columns='Unnamed: 0', axis=1)

In [ ]:
gb02_df.index()